{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "arguments": {}, "batch_input_shape": [null, 66, 200, 3], "dtype": "float32", "trainable": true, "name": "lambda_6", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA05nAAAAAADgb0BnAAAAAAAA\n4D+pACkB2gF4cgEAAAByAQAAAPofPGlweXRob24taW5wdXQtMjgtYTcxZjIyZDFiNzM1PtoIPGxh\nbWJkYT4DAAAAcwAAAAA=\n", null, null], "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "re_conv1", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "filters": 24, "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "re_maxpool1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "re_conv2", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "filters": 36, "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "re_maxpool2", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "re_conv3", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "filters": 48, "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "re_maxpool3", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "re_conv4", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "re_maxpool4", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "re_conv5", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "re_maxpool5", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "name": "re_bn1", "momentum": 0.99, "epsilon": 0.001, "center": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "re_den1", "units": 1164, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_18", "noise_shape": null, "rate": 0.25, "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "re_den2", "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_19", "noise_shape": null, "rate": 0.25, "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "re_den3", "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_20", "noise_shape": null, "rate": 0.25, "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "re_den4", "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_21", "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_6", "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "trainable": true, "use_bias": true, "kernel_regularizer": null, "activation": "linear"}}], "keras_version": "2.1.3"}